Autodesk.Revit.DB.CurveByPointsUtils.CreateRectangle(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ReferencePoint,Autodesk.Revit.DB.ReferencePoint,Autodesk.Revit.DB.CurveProjectionType,System.Boolean,System.Boolean,System.Collections.Generic.IList`1{Autodesk.Revit.DB.ElementId}@,System.Collections.Generic.IList`1{Autodesk.Revit.DB.ElementId}@)
Creates rectangle on face or sketchplane for two given diagonal points.
Remarks:
This array contains the ElementIds of the two additional corner points that are created to complete the rectangle.
document:
The Document.
startPoint:
First diagonal point of rectangle.
endPoint:
Second diagonal point of rectangle.
projectionType:
Projection type of rectangle's boundary curves.
If the rectangle input points are Face hosted, and CurveProjectionType::ParallelToLevel is requested,
and the Face normal at the location of the start point is at a less than 45 degree angle with the level
planes, then the projectionType will be set to FromTopDown, even if ParallelToLevel was requested.
boundaryReferenceLines:
True if rectangle's boundary curves should be reference lines, false otherwise.
boundaryCurvesFollowSurface:
True if rectangle's boundary curves should follow surface, false otherwise.
createdCurvesIds:
Created rectangle's boundary curves ids.
createdCornersIds:
Ids of two newly created corner points.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Unexpected projection type.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Unable to create rectangle.
Since:
2012

Autodesk.Revit.DB.CurveByPointsUtils.AddCurvesToFaceRegion(Autodesk.Revit.DB.Document,System.Collections.Generic.IList`1{Autodesk.Revit.DB.ElementId})
Adds The CurveElements to one or more FaceRegions.
Remarks:
The CurveElements that are input may produce an arbitrary number of regions.
document:
The Document.
curveElemIds:
The ElementIds of CurveElements which are to define the FaceRegion.
Throws Autodesk.Revit.Exceptions.ArgumentException:
All the input CurveElements must be CurveByPoints, with the sketchOnSurface attribute set to True, and for each CurveElement, the defining
ReferencePoints must be hosted on References related to a common Face or Edge.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to add curves to FaceRegion.
Since:
2012

Autodesk.Revit.DB.CurveByPointsUtils.ValidateCurveElementIdArrayForFaceRegions(Autodesk.Revit.DB.Document,System.Collections.Generic.IList`1{Autodesk.Revit.DB.ElementId})
Validates that the input CurveElements can define FaceRegions.
The CurveElements must be CurveByPoints.  Each curve must be entirely hosted by a single Face or hosts related to a common
Face (for example, Edges of a common Face, other CurveElements hosted by a common Face). To be added to the FaceRegion definition,
a CurveElement must have the SketchOnSurface attribute set.
document:
The Document.
curveElemIds:
The CurveElements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012